Tutorials/spillingBreaker/kOmega2006/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
RASModel        kOmegaWilcox2006Stab;//kOmegaWilcox2006Stab; //LRRbuoyant; 

turbulence      on;

printCoeffs     on;


kOmegaWilcox2006StabCoeffs
{alphaBS 1.356;
lambda2 0.05;
Clim 0.2;
}
}



// ************************************************************************* //
