Tutorials/spillingBreaker/kOmega2006/constant/probeDefinitions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      loggingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceElevationAnyName
{
    type waveGauge;

    pointDistribution lineDistribution;
    N 186;
    linestart (-4.5 -0.3 0.05);
    lineend   (14.35 -0.3 0.05);
    add       ( 0 0.45 0);
    axis      y;
    stretch 1.;

    writeControl timeStep;
    writeInterval 1; 
}


// ************************************************************************* //
